/* minutes:seconds time length format in browser mode */
"%.2d:%.2d" = "%1$.2d.%2$.2d";

/* hours:minutes:seconds time length format in browser mode */
"%.2d:%.2d:%.2d" = "%1$.2d.%2$.2d.%3$.2d";

/* Size on disk */
"%@ on disk" = "%@ levyllä";

/* The format for the today/yesterday string shown in the open/save panel followed by a comma, fillowed by the time */
"%@, %@" = "%1$@, %2$@";

/* Label for scope bar button for multiple scopes. */
"%d Places" = "%d sijaintia";

/* Indicates the non plural one item found by a spotlight search.  Arg is the number that was found, which will always be 1 */
"%ld item" = "%ld kohde";

/* Indicates the number of items found by a spotlight search.  Arg is the number that was found. */
"%ld items" = "%ld kohdetta";

/* Label for scope bar button for multiple scopes. */
"%ld Places" = "%ld sijaintia";

/* Dimension format label shown in browser mode */
"%ld\\U2006\\U00D7\\U2006%ld" = "%1$ld × %2$ld";

/* Property not shown value (dash dash) */
"--" = "--";

/* quotes for a label */
"\\U201c%@\\U201d" = "”%@”";

/* Title for overwiting existing file confirmation dialog. */
"\\U201c%@\\U201d already exists. Do you want to replace it?" = "”%@” on jo olemassa. Haluatko korvata sen?";

/* Dot dot dot to be shown for truncated text */
"\\U2026" = "…";

/* Message for overwriting existing file confirmation dialog. First arg is the directory containing the file. */
"A file or folder with the same name already exists in the folder %@. Replacing it will overwrite its current contents." = "Kansiossa %@ on jo samanniminen tiedosto tai kansio. Sen korvaaminen ylikirjoittaa nykyisen sisällön.";

/* Message for overwriting existing file confirmation dialog on the desktop. First arg is the directory containing the file (translate desktop word). */
"A file or folder with the same name already exists on the %@. Replacing it will overwrite its current contents." = "Kansiossa %@ on jo samanniminen tiedosto tai kansio. Sen korvaaminen ylikirjoittaa nykyisen sisällön.";

/* Error to display for duplicate file name overwrite of smart folders. */
"An item already exists with that name. Rename the item and try again." = "Samanniminen kohde on jo olemassa. Anna kohteelle eri nimi ja yritä uudelleen.";

/* Ask to use... text shown on the button in the shared server panel */
"Ask to use\\U2026" = "Pyydä käyttää…";

/* Title for asking to use the disc drive via over the air disc drive sharing */
"Asking to use the %@ drive in \\U201c%@\\U201d\\U2026" = "Pyydetään käyttää asemaa %1$@ kohteessa ”%2$@”…";

/* Asking to use... title to show as text label in shared server panel. */
"Asking to use\\U2026" = "Pyydetään käyttää…";

/* Calculating Size label shown in browser mode */
"Calculating Size" = "Lasketaan kokoa";

/* Button text to cancel save operation. */
"Cancel" = "Kumoa";

/* CD drive title */
"CD" = "CD";

/* Label for scope bar button which represents the 'everywhere' scope.  Note this really searches everywhere by HI determined the word 'Everywhere' is too ambiguous. */
"Computer" = "Tietokoneesta";

/* Connect As... text shown on the button in the shared server panel */
"Connect As\\U2026" = "Yhdistä nimellä…";

/* Connected title to show as text label in shared server panel. */
"Connected" = "Yhteydessä";

/* Text to show who we are connected as in the server panel. */
"Connected as: %@" = "Yhteydessä tunnuksella: %@";

/* Connecting... title to show as text label in shared server panel. */
"Connecting\\U2026" = "Yhdistetään…";

/* Connection Failed title to show as text label in shared server panel. */
"Connection Failed" = "Yhteys epäonnistui";

/* Label for scoep bar button Contents */
"Contents" = "Sisältö";

/* Title for devices in the sidebar of the open/save panel */
"DEVICES" = "LAITTEET";

/* Dimensions label shown in browser mode */
"Dimensions" = "Mitat";

/* disc drive title */
"disc" = "levy";

/* Disconnect text shown on the button in the shared server panel */
"Disconnect" = "Katkaise";

/* Title prompt used when asking to save a smart folder that has changed. */
"Do you want to save this Smart Folder?" = "Haluatko tallentaa tämän älykkään kansion?";

/* Button text to not save the smart folder. */
"Don\\U2019t Save" = "Älä tallenna";

/* DVD drive title */
"DVD" = "DVD";

/* Label for the edit button above the rule editor in the advanced search mode. */
"Edit" = "Muokkaus";

/* eject button title */
"Eject" = "Poista";

/* eject all button title */
"Eject All" = "Poista kaikki näkyvistä";

/* Fetching... label shown in browser mode */
"Fetching..." = "Haetaan...";

/* Label for scoep bar button File Name */
"File Name" = "Tiedostonimi";

/* Label for scope bar button which represents the home directory. */
"Home" = "Kotikansiosta";

/* Message for file name starts with a dot dialog. */
"If you decide to go ahead and use a name which begins with a dot the file will be hidden." = "Tiedosto piilotetaan, jos käytät pistettä (.) nimen edessä.";

/* Message prompt used when asking to save a smart folder that has changed. */
"If you don\\U2019t save, the changes you made to \\U201c%@\\U201d will be lost." = "Jos et tallenna, kohteeseen ”%@” tehdyt muutokset menetetään.";

/* Media Browser node title in the sidebar on the left */
"Media" = "Media";

/* Title for media section in the sidebar of the open/save panel */
"MEDIA" = "MEDIA";

/* Movices media browser node title */
"Movies" = "Elokuvat";

/* Music media browser node title */
"Music" = "Musiikki";

/* Title for file name that is greater than 31 characters on a short file name volume. */
"Names longer than 31 characters are not supported on the destination volume." = "Kohdetaltio ei tue yli 31 merkkiä pitkiä nimiä.";

/* Title for file name starts with a dot dialog. */
"Names that begin with a dot \\U201c.\\U201d are reserved for the system." = "Pisteellä ”.” alkavat nimet on varattu järjestelmän käyttöön.";

/* Not Connected title to show as text label in shared server panel. */
"Not Connected" = "Ei yhteydessä";

/* default button of open panel
   window title of open panel */
"Open" = "Avaa";

/* Title for button to 'Open <MobileMe> Preferences' */
"Open %@ Preferences" = "Avaa asetukset: %@";

/* Menu item title in advanced search for adding additional search criteria not specified in the list - with ellipses. */
"Other\\U2026" = "Muu…";

/* Photos media browser node title */
"Photos" = "Valokuvat";

/* Title for places section in the sidebar of the open/save panel */
"PLACES" = "PAIKAT";

/* Message for file name longer than 31 characters. */
"Please choose a filename that is no longer than 31 characters." = "Valitse tiedostonimi, joka on enintään 31 merkkiä pitkä.";

/* Title shown in an alert dialog for a location that can't be found. */
"Please select another item." = "Valitse toinen kohde.";

/* Recent Places label */
"Recent Places" = "Äskeiset sijainnit";

/* Button text to overwrite an existing file. */
"Replace" = "Korvaa";

/* Request denied title to show as text label in shared server panel. */
"Request denied" = "Pyyntö hylätty";

/* Button text to save the smart folder.
   default button of save panel
   Label for the save button above the rule editor in the advanced search mode.
   window title of save panel */
"Save" = "Tallenna";

/* Label for the save as button above the rule editor in the advanced search mode. */
"Save As" = "Tallenna nimellä";

/* name field label */
"Save As:" = "Tallenna nimellä:";

/* Title for smart folders section in side bar. */
"Saved Searches" = "Tallennetut haut";

/* Title for app specific saved searches in the sidebar of the open/save panel */
"SAVED SEARCHES" = "TALLENNETUT HAUT";

/* Title for search for section in the sidebar of the open/save panel */
"SEARCH FOR" = "ETSI";

/* Label for scope bar button which represents the 'search:' title. */
"Search:" = "Etsi:";

/* Label for popup button in save panel mini mode when current location is a search. */
"Searching for \\U201c%@\\U201d" = "Etsitään kohdetta ”%@”";

/* The string to display in the path location control when there is no selected item in the search results. */
"Select an item to see its path." = "Näet kohteen polun valitsemalla sen.";

/* Label for scope bar button which represents the servers scope. */
"Servers" = "Palvelimet";

/* Title for shared in the sidebar of the open/save panel */
"SHARED" = "JAETUT";

/* Label for scope bar button which represents the 'smart folder' title. */
"Smart Folder" = "Älykäs kansio";

/* Smart Folders label */
"Smart Folders" = "Älykkäät kansiot";

/* String to show when hovering over the X button in the ask to use UI for ODS */
"Stop asking to use\\U2026" = "Lopeta käytön pyytäminen…";

/* String to show when hovering over the X button when waiting for a disc */
"Stop waiting for disc\\U2026" = "Lopetetaan levyn odottaminen…";

/* Warning to show when ejecting ONE item that has other mounted volumes */
"The device containing \\U201c%@\\U201d also contains %ld other volume that will not be ejected. Are you sure you want to eject \\U201c%@\\U201d?" = "Taltion ”%1$@” sisältävässä laitteessa on myös %2$ld muu taltio, jota ei poisteta näkyvistä. Haluatko varmasti poistaa taltion ”%3$@” näkyvistä?";

/* Warning to show when ejecting MORE THAN ONE item that has other mounted volumes */
"The device containing \\U201c%@\\U201d also contains %ld other volumes that will not be ejected. Are you sure you want to eject \\U201c%@\\U201d?" = "Taltion ”%1$@” sisältävässä laitteessa on myös %2$ld muuta taltiota, joita ei poisteta näkyvistä. Haluatko varmasti poistaa taltion ”%3$@” näkyvistä?";

/* Label the 'goto' dialog when it can't find a folder. Same as Finders version. */
"The folder cannot be found." = "Kansiota ei löydy.";

/* The string to display in the path location control when the selected items do not share a common path. */
"The selected items do not share a path." = "Valitut kohteet eivät ole samassa polussa.";

/* Message shown in an alert dialog for a location that can't be found. */
"The volume for \\U201c%@\\U201d could not be found." = "Kohteen ”%@” taltiota ei löytynyt.";

/* error message for lacking write permission to create new folder */
"This location is read-only." = "Sijainti on kirjoitussuojattu.";

/* Label for scope bar button which represents the 'This Mac' scope. Used to be called Computer. */
"This Mac" = "Tästä Macista";

/* error message for new folder name conflict */
"This name is already taken." = "Nimi on jo käytössä.";

/* Message to show about ejecting everthing */
"To eject all the volumes on this device hold down the Option key while ejecting the volume.\n\nIn the future, to eject a single volume without seeing this dialog, hold down the Control key while ejecting the volume." = "Voit poistaa kaikki laitteen taltiot kerralla näkyvistä pitämällä Optio-näppäintä painettuna poistaessasi yhtä taltiota näkyvistä.\n\nVoit vastaisuudessa poistaa yksittäisen taltion näkyvistä näkemättä tätä valintataulua pitämällä Ctrl-näppäintä painettuna poistaessasi taltiota näkyvistä.";

/* Today: String shown in save panel date cell when trying to save space */
"Today" = "Tänään";

/* Undo the name change in the save panel by clicking on a disabled item */
"Undo Name Change" = "Peru Nimen muutos";

/* default new folder name */
"untitled folder" = "Nimetön kansio";

/* Button text to choose required extension. Arg is file name extension.
   Button text to choose the alternative extension. Arg is file name extension. */
"Use .%@" = "Käytä .%@";

/* Button text to use a filename starting with a dot. */
"Use \\U201c.\\U201d" = "Käytä ”.”";

/* Button text to choose combined extensions. */
"Use both" = "Käytä molempia";

/* Using disc drive title to show as text label in shared server panel. */
"Using disc drive\\U2026" = "Käytetään levyasemaa…";

/* Waiting for disc drive title to show as text label in shared server panel. */
"Waiting for disc drive\\U2026" = "Odotetaan levyasemaa…";

/* Title string shown when waiting for a disc in the over the air remote disc drive support */
"Waiting for disc\\U2026" = "Odotetaan levyä…";

/* Yesterday: String shown in save panel date cell when trying to save space */
"Yesterday" = "Eilen";

/* Information on choices. 1st arg is current extension. 2nd arg is required extension. */
"You can choose to use both, so that your file name ends in \\U201c.%1$@.%2$@\\U201d." = "Voit käyttää molempia, jolloin tiedoston tarkenne on ”.%1$@.%2$@”.";

/* Information on choices. */
"You can choose to use the standard extension instead." = "Voit sen sijaan käyttää vakiotarkennetta.";

/* Message when user wants to save with invalid file extension. 1st arg is current extension. 2nd arg is required extension. */
"You cannot save this document with extension \\U201c.%1$@\\U201d at the end of the name. The required extension is \\U201c.%2$@\\U201d." = "Dokumenttia ei voida tallentaa nimen lopussa olevalla tarkenteella ”.%1$@”. Vaadittu tarkenne on ”.%2$@”.";

/* Message when user wants to save with an alternative file extension - for panels configured to permit this. 1st arg is current extension. 2nd arg is required extension. */
"You have used the extension \\U201c.%1$@\\U201d at the end of the name. The standard extension is \\U201c.%2$@\\U201d." = "Olet käyttänyt nimen lopussa tarkennetta ”.%1$@”. Vakiotarkenne on ”.%2$@”.";

/* Message to display to prompt to setup iDisk / MobileMe / .mac */
"Your %@ account is not set up. Would you like to open %@ preferences and set it up now?" = "%1$@-tunnusta ei ole otettu käyttöön. Haluatko avata %2$@-asetukset ja ottaa sen käyttöön nyt?";

/* Title to show when DVD/CD remote use was declined */
"Your request to use the %@ drive in \\U201c%@\\U201d\\U2026 was declined." = "Pyyntösi käyttää asemaa %1$@ kohteessa ”%2$@”… on hylätty.";

